VUGenSkripts/US3_Buying_Product/result1/Iteration19/t24.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886345678901234</ns2:cardNumber><ns2:expirationDate>082029</ns2:expirationDate><ns2:cvvNumber>123</ns2:cvvNumber><ns2:customerName>el</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>